RT-Thread/rt-thread/bsp/mm32f327x/Libraries/MM32F327x/Include/mm32_reg_redefine_v1.h
////////////////////////////////////////////////////////////////////////////////
/// @file     mm32_reg_define_v1.H
/// @author   AE TEAM
/// @brief    THIS FILE CONTAINS ALL THE define for version compatibility define
///           FIRMWARE LIBRARY.
////////////////////////////////////////////////////////////////////////////////
/// @attention
///
/// THE EXISTING FIRMWARE IS ONLY FOR REFERENCE, WHICH IS DESIGNED TO PROVIDE
/// CUSTOMERS WITH CODING INFORMATION ABOUT THEIR PRODUCTS SO THEY CAN SAVE
/// TIME. THEREFORE, MINDMOTION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
/// CONSEQUENTIAL DAMAGES ABOUT ANY CLAIMS ARISING OUT OF THE CONTENT OF SUCH
/// HARDWARE AND/OR THE USE OF THE CODING INFORMATION CONTAINED HEREIN IN
/// CONNECTION WITH PRODUCTS MADE BY CUSTOMERS.
///
/// <H2><CENTER>&COPY; COPYRIGHT MINDMOTION </CENTER></H2>
////////////////////////////////////////////////////////////////////////////////

// Define to prevent recursive inclusion
#ifndef __MM32_REG_DEFINE_V1_H
#define __MM32_REG_DEFINE_V1_H

// Files includes


////////////////////////////////////////////////////////////////////////////////
/// @brief Version compatibility definition
////////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////////
/// @brief redefine for register
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
/// @brief redefine for ADC of MCU register
////////////////////////////////////////////////////////////////////////////////

#define ADC_COMP_IRQHandler             ADC1_COMP_IRQHandler

#define ADDATA_DATA                     ADC_DR_DATA

#define ADDATA_CHANNELSEL               ADC_DR_CH
#define ADDATA_CHANNELSEL_0             ADC_DR_CH0
#define ADDATA_CHANNELSEL_1             ADC_DR_CH1
#define ADDATA_CHANNELSEL_2             ADC_DR_CH2
#define ADDATA_CHANNELSEL_3             ADC_DR_CH3
#define ADDATA_CHANNELSEL_4             ADC_DR_CH4
#define ADDATA_CHANNELSEL_5             ADC_DR_CH5
#define ADDATA_CHANNELSEL_6             ADC_DR_CH6
#define ADDATA_CHANNELSEL_7             ADC_DR_CH7




#define ADDATA_CHANNELSEL_CH8           ADC_DR_CH8
#define ADDATA_CHANNELSEL_CH9           ADC_DR_CH9
#define ADDATA_CHANNELSEL_CH10          ADC_DR_CH10
#define ADDATA_CHANNELSEL_CH11          ADC_DR_CH11
#define ADDATA_CHANNELSEL_CH12          ADC_DR_CH12
#define ADDATA_CHANNELSEL_CH13          ADC_DR_CH13
#define ADDATA_CHANNELSEL_CH14          ADC_DR_CH14
#define ADDATA_CHANNELSEL_CH15          ADC_DR_CH15
#define ADDATA_CHANNELSEL_TempSensor    ADC_DR_TempSensor
#define ADDATA_CHANNELSEL_VolSensor     ADC_DR_VoltRef


#define ADDATA_OVERRUN                  ADC_DR_OVERRUN
#define ADDATA_VALID                    ADC_DR_VALID

#define ADCFG_ADEN                      ADC_CFGR_ADEN
#define ADCFG_ADWEN                     ADC_CFGR_ADWEN

#define ADCFG_RSLTCTL                   ADC_CFGR_RSLTCTL
#define ADCFG_RSLTCTL_12                ADC_CFGR_RSLTCTL_12
#define ADCFG_RSLTCTL_11                ADC_CFGR_RSLTCTL_11
#define ADCFG_RSLTCTL_10                ADC_CFGR_RSLTCTL_10
#define ADCFG_RSLTCTL_9                 ADC_CFGR_RSLTCTL_9
#define ADCFG_RSLTCTL_8                 ADC_CFGR_RSLTCTL_8


#define ADCFG_TSEN                      ADC_CFGR_TEN
#define ADCFG_VSEN                      ADC_CFGR_VEN

#define ADCFG_ADCPRE                    ADC_CFGR_PRE
#define ADCFG_ADCPRE_2                  ADC_CFGR_PRE_2
#define ADCFG_ADCPRE_4                  ADC_CFGR_PRE_4
#define ADCFG_ADCPRE_6                  ADC_CFGR_PRE_6
#define ADCFG_ADCPRE_8                  ADC_CFGR_PRE_8
#define ADCFG_ADCPRE_10                 ADC_CFGR_PRE_10
#define ADCFG_ADCPRE_12                 ADC_CFGR_PRE_12
#define ADCFG_ADCPRE_14                 ADC_CFGR_PRE_14
#define ADCFG_ADCPRE_16                 ADC_CFGR_PRE_16
#define ADCFG_SAMCTL                    ADC_CFGR_SAMCTL
#define ADCFG_SAMCTL_1_5                ADC_CFGR_SAMCTL_1_5
#define ADCFG_SAMCTL_7_5                ADC_CFGR_SAMCTL_7_5
#define ADCFG_SAMCTL_13_5               ADC_CFGR_SAMCTL_13_5
#define ADCFG_SAMCTL_28_5               ADC_CFGR_SAMCTL_28_5
#define ADCFG_SAMCTL_41_5               ADC_CFGR_SAMCTL_41_5
#define ADCFG_SAMCTL_55_5               ADC_CFGR_SAMCTL_55_5
#define ADCFG_SAMCTL_71_5               ADC_CFGR_SAMCTL_71_5
#define ADCFG_SAMCTL_239_5              ADC_CFGR_SAMCTL_239_5


#define ADCFG_ADCPRE_3                  ADC_CFGR_PRE_3
#define ADCFG_ADCPRE_5                  ADC_CFGR_PRE_5
#define ADCFG_ADCPRE_7                  ADC_CFGR_PRE_7
#define ADCFG_ADCPRE_9                  ADC_CFGR_PRE_9
#define ADCFG_ADCPRE_11                 ADC_CFGR_PRE_11
#define ADCFG_ADCPRE_13                 ADC_CFGR_PRE_13
#define ADCFG_ADCPRE_15                 ADC_CFGR_PRE_15
#define ADCFG_ADCPRE_17                 ADC_CFGR_PRE_17
#define ADCFG_SAMCTL_2_5                ADC_CFGR_SAMCTL_2_5
#define ADCFG_SAMCTL_3_5                ADC_CFGR_SAMCTL_3_5
#define ADCFG_SAMCTL_4_5                ADC_CFGR_SAMCTL_4_5
#define ADCFG_SAMCTL_5_5                ADC_CFGR_SAMCTL_5_5
#define ADCFG_SAMCTL_6_5                ADC_CFGR_SAMCTL_6_5

#define ADCR_ADIE                       ADC_CR_ADIE
#define ADCR_ADWIE                      ADC_CR_ADWIE
#define ADCR_TRGEN                      ADC_CR_TRGEN
#define ADCR_DMAEN                      ADC_CR_DMAEN
#define ADCR_ADST                       ADC_CR_ADST
#define ADCR_ADMD                       ADC_CR_MODE
#define ADCR_ADMD_SINGLE                ADC_CR_IMM
#define ADCR_ADMD_PERIOD                ADC_CR_SCAN
#define ADCR_ADMD_CONTINUE              ADC_CR_CONTINUE
#define ADC_Mode_Single                 ADC_CR_IMM
#define ADC_Mode_Single_Period          ADC_CR_SCAN
#define ADC_Mode_Continuous_Scan        ADC_CR_CONTINUE


#define ADCR_ALIGN                      ADC_CR_ALIGN
#define ADCR_ALIGN_LEFT                 ADC_CR_LEFT
#define ADCR_ALIGN_RIGHT                ADC_CR_RIGHT
#define ADCR_CMPCH_Pos                  ADC_CR_CMPCH_Pos
#define ADCR_CMPCH                      ADC_CR_CMPCH
#define ADCR_CMPCH_0                    ADC_CR_CMPCH_0
#define ADCR_CMPCH_1                    ADC_CR_CMPCH_1
#define ADCR_CMPCH_2                    ADC_CR_CMPCH_2
#define ADCR_CMPCH_4                    ADC_CR_CMPCH_4
#define ADCR_CMPCH_5                    ADC_CR_CMPCH_5
#define ADCR_CMPCH_6                    ADC_CR_CMPCH_6
#define ADCR_CMPCH_7                    ADC_CR_CMPCH_7
#define ADCR_CMPCH_8                    ADC_CR_CMPCH_8
#define ADCR_CMPCH_9                    ADC_CR_CMPCH_9
#define ADCR_CMPCH_10                   ADC_CR_CMPCH_10
#define ADCR_CMPCH_11                   ADC_CR_CMPCH_11
#define ADCR_CMPCH_13                   ADC_CR_CMPCH_13
#define ADCR_CMPCH_14                   ADC_CR_CMPCH_14
#define ADCR_CMPCH_ALL                  ADC_CR_CMPCH_ALL


#define ADCR_TRGSEL                     ADC_CR_TRGSEL
#define ADCR_TRGSEL_T1_CC1              ADC_CR_T1_CC1
#define ADCR_TRGSEL_T1_CC2              ADC_CR_T1_CC2
#define ADCR_TRGSEL_T1_CC3              ADC_CR_T1_CC3
#define ADCR_TRGSEL_T2_CC2              ADC_CR_T2_CC2
#define ADCR_TRGSEL_T3_TRGO             ADC_CR_T3_TRIG
#define ADCR_TRGSEL_EXTI_11             ADC_CR_EXTI_11



#define ADCR_TRGSEL_T1_CC4_CC5          ADC_CR_T1_CC4_CC5
#define ADCR_TRGSEL_T3_CC1              ADC_CR_T3_CC1
#define ADCR_TRGSEL_T1_TRGO             ADC_CR_T1_TRIG
#define ADCR_TRGSEL_T8_CC4              ADC_CR_T8_CC4
#define ADCR_TRGSEL_T8_CC4_CC5          ADC_CR_T8_CC4_CC5
#define ADCR_TRGSEL_T2_CC1              ADC_CR_T2_CC1
#define ADCR_TRGSEL_T3_CC4              ADC_CR_T3_CC4
#define ADCR_TRGSEL_T2_TRGO             ADC_CR_T2_TRIG
#define ADCR_TRGSEL_T8_CC5              ADC_CR_T8_CC5
#define ADCR_TRGSEL_EXTI_15             ADC_CR_EXTI_15
#define ADCR_TRGSEL_TIM1_CC4            ADC_CR_TIM1_CC4
#define ADCR_TRGSEL_TIM1_CC5            ADC_CR_TIM1_CC5
#define ADCR_SCANDIR                    ADC_CR_SCANDIR
#define ADCR_TRGSHIFT                   ADC_CR_TRGSHIFT
#define ADCR_TRGSHIFT_0                 ADC_CR_TRGSHIFT_0
#define ADCR_TRGSHIFT_4                 ADC_CR_TRGSHIFT_4
#define ADCR_TRGSHIFT_16                ADC_CR_TRGSHIFT_16
#define ADCR_TRGSHIFT_32                ADC_CR_TRGSHIFT_32
#define ADCR_TRGSHIFT_64                ADC_CR_TRGSHIFT_64
#define ADCR_TRGSHIFT_128               ADC_CR_TRGSHIFT_128
#define ADCR_TRGSHIFT_256               ADC_CR_TRGSHIFT_256
#define ADCR_TRGSHIFT_512               ADC_CR_TRGSHIFT_512
#define ADCR_CALIBEN                    ADC_CR_CALIBEN
#define ADCR_CALIBSEL                   ADC_CR_CALIBSEL

