RT-Thread/rt-thread/bsp/mm32f327x/Libraries/MM32F327x/Include/mm32_reg_redefine_v1.h
#define I2C_ENABLE_ENABLE               I2C_ENR_ENABLE
#define I2C_ENABLE_ABORT                I2C_ENR_ABORT

#define I2C_STATUS_ACTIVITY             I2C_SR_ACTIV
#define I2C_STATUS_TFNF                 I2C_SR_TFNF
#define I2C_STATUS_TFE                  I2C_SR_TFE
#define I2C_STATUS_RFNE                 I2C_SR_RFNE
#define I2C_STATUS_RFF                  I2C_SR_RFF
#define I2C_STATUS_MST_ACTIVITY         I2C_SR_MST_ACTIV
#define I2C_STATUS_SLV_ACTIVITY         I2C_SR_SLV_ACTIV

#define I2C_TXFLR                       I2C_TXFLR_CNT
#define I2C_RXFLR                       I2C_RXFLR_CNT

#define I2C_SDA_TX_HOLD                 I2C_HOLD_TXCNT
#define I2C_SDA_RX_HOLD                 I2C_HOLD_RXCNT
#define I2C_DMA_CR_RDMAE                I2C_DMA_RXEN
#define I2C_DMA_CR_TDMAE                I2C_DMA_TXEN
#define I2C_SDA_SET_UP                  I2C_SETUP_CNT
#define I2C_ACK_GENERAL_CALL            I2C_GCR_GC


#define IWDG_PR_PR                      IWDG_PR_PRE
#define IWDG_PR_PR_DIV4                 IWDG_PR_PRE_DIV4
#define IWDG_PR_PR_DIV8                 IWDG_PR_PRE_DIV8
#define IWDG_PR_PR_DIV16                IWDG_PR_PRE_DIV16
#define IWDG_PR_PR_DIV32                IWDG_PR_PRE_DIV32
#define IWDG_PR_PR_DIV64                IWDG_PR_PRE_DIV64
#define IWDG_PR_PR_DIV128               IWDG_PR_PRE_DIV128
#define IWDG_PR_PR_DIV256               IWDG_PR_PRE_DIV256
////////////////////////////////////////////////////////////////////////////////
/// @brief Version compatibility definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_AHBENR_DMAEN                RCC_AHBENR_DMA1
#define RCC_AHBENR_DMA1EN               RCC_AHBENR_DMA1


////////////////////////////////////////////////////////////////////////////////
/// @defgroup AHB_peripheral
/// @{
#define RCC_AHBPeriph_DMA1              RCC_AHBENR_DMA1
#define RCC_AHBPeriph_SRAM              RCC_AHBENR_SRAM
#define RCC_AHBPeriph_FLITF             RCC_AHBENR_FLITF
#define RCC_AHBPeriph_CRC               RCC_AHBENR_CRC
#define RCC_AHBPeriph_AES               RCC_AHBENR_AES
#define RCC_AHBPeriph_GPIOA             RCC_AHBENR_GPIOA
#define RCC_AHBPeriph_GPIOB             RCC_AHBENR_GPIOB
#define RCC_AHBPeriph_GPIOC             RCC_AHBENR_GPIOC
#define RCC_AHBPeriph_GPIOD             RCC_AHBENR_GPIOD


#define RCC_AHBPeriph_GPIOE             RCC_AHBENR_GPIOE
#define RCC_AHBPeriph_HIV               RCC_AHBENR_HWDIV
#define RCC_AHBPeriph_HWDIV             RCC_AHBENR_HWDIV




/// @}

////////////////////////////////////////////////////////////////////////////////
/// @defgroup APB2_peripheral
/// @{
#define RCC_APB2Periph_ADC1             RCC_APB2ENR_ADC1
#define RCC_APB2Periph_TIM1             RCC_APB2ENR_TIM1
#define RCC_APB2Periph_SPI1             RCC_APB2ENR_SPI1
#define RCC_APB2Periph_UART1            RCC_APB2ENR_UART1
#define RCC_APB2Periph_COMP             RCC_APB2ENR_COMP
#define RCC_APB2Periph_DBGMCU           RCC_APB2ENR_DBGMCU

#define RCC_APB2ENR_ADC1EN              RCC_APB2ENR_ADC1
#define RCC_APB2ENR_TIM1EN              RCC_APB2ENR_TIM1
#define RCC_APB2RSTR_ADC1RST            RCC_APB2RSTR_ADC1

#define RCC_APB2Periph_ADC2             RCC_APB2ENR_ADC2
#define RCC_APB2Periph_ADC3             RCC_APB2ENR_ADC3
#define RCC_APB2Periph_SYSCFG           RCC_APB2ENR_SYSCFG
#define RCC_APB2Periph_EXTI             RCC_APB2ENR_EXTI

/// @}

////////////////////////////////////////////////////////////////////////////////
/// @defgroup APB1_peripheral
/// @{
#define RCC_APB1Periph_TIM2             RCC_APB1ENR_TIM2
#define RCC_APB1Periph_TIM3             RCC_APB1ENR_TIM3
#define RCC_APB1Periph_TIM4             RCC_APB1ENR_TIM4
#define RCC_APB1Periph_UART3            RCC_APB1ENR_UART3
#define RCC_APB1Periph_BKP              RCC_APB1ENR_BKP
#define RCC_APB1Periph_DAC              RCC_APB1ENR_DAC
#define RCC_APB1Periph_I2C2             RCC_APB1ENR_I2C2
#define RCC_APB1Periph_ALL              0x3AE64807
#define RCC_APB1Periph_CAN1             RCC_APB1ENR_CAN
#define RCC_APB1Periph_CRS              RCC_APB1ENR_CRS
#define RCC_APB1Periph_UART2            RCC_APB1ENR_UART2
#define RCC_APB1Periph_I2C1             RCC_APB1ENR_I2C1
#define RCC_APB1Periph_SPI2             RCC_APB1ENR_SPI2
#define RCC_APB1Periph_WWDG             RCC_APB1ENR_WWDG
#define RCC_APB1Periph_PWR              RCC_APB1ENR_PWR

#define RCC_APB1ENR_PWREN               RCC_APB1ENR_PWR
#define RCC_APB1ENR_TIM2EN              RCC_APB1ENR_TIM2
#define RCC_APB1ENR_TIM3EN              RCC_APB1ENR_TIM3
#define RCC_APB1ENR_SYSCFG              RCC_APB1ENR_EXTI


////////////////////////////////////////////////////////////////////////////////
/// @brief RTC_CR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RTC_CRH_SECIE_Pos               RTC_CR_SECIE_Pos
#define RTC_CRH_SECIE                   RTC_CR_SECIE                  ///< Second Interrupt Enable
#define RTC_CRH_ALRIE_Pos               RTC_CR_ALRIE_Pos
#define RTC_CRH_ALRIE                   RTC_CR_ALRIE                  ///< Alarm Interrupt Enable
#define RTC_CRH_OWIE_Pos                RTC_CR_OWIE_Pos
#define RTC_CRH_OWIE                    RTC_CR_OWIE                   ///< OverfloW Interrupt Enable

////////////////////////////////////////////////////////////////////////////////
/// @brief RTC_CSR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RTC_CRL_SECF_Pos                RTC_CSR_SECF_Pos
#define RTC_CRL_SECF                    RTC_CSR_SECF                   ///< Second Flag
#define RTC_CRL_ALRF_Pos                RTC_CSR_ALRF_Pos
#define RTC_CRL_ALRF                    RTC_CSR_ALRF                   ///< Alarm Flag
#define RTC_CRL_OWF_Pos                 RTC_CSR_OWF_Pos
#define RTC_CRL_OWF                     RTC_CSR_OWF                    ///< OverfloW Flag
#define RTC_CRL_RSF_Pos                 RTC_CSR_RSF_Pos
#define RTC_CRL_RSF                     RTC_CSR_RSF                    ///< Registers Synchronized Flag
#define RTC_CRL_CNF_Pos                 RTC_CSR_CNF_Pos
#define RTC_CRL_CNF                     RTC_CSR_CNF                    ///< Configuration Flag
#define RTC_CRL_RTOFF_Pos               RTC_CSR_RTOFF_Pos
#define RTC_CRL_RTOFF                   RTC_CSR_RTOFF                  ///< RTC operation OFF
#define RTC_CRL_ALPEN_Pos               RTC_CSR_ALPEN_Pos
#define RTC_CRL_ALPEN                   RTC_CSR_ALPEN                  ///< RTC Alarm Loop Enable



////////////////////////////////////////////////////////////////////////////////
/// @brief Version compatibility definition
////////////////////////////////////////////////////////////////////////////////
#define SPI_TXREG_TXREG                 SPI_TDR_TXREG
#define SPI_RXREG_RXREG                 SPI_RDR_RXREG

