RT-Thread/rt-thread/bsp/mm32f327x/Libraries/MM32F327x/Include/mm32_reg_redefine_v1.h
///-------------------  Bit definition for SETUP1 register  --------------------
//#define SETUP1 ((u16)0x00FF)

///-------------------  Bit definition for SETUP2 register  --------------------
//#define SETUP2 ((u16)0x00FF)

///-------------------  Bit definition for SETUP3 register  --------------------
//#define SETUP3 ((u16)0x00FF)

///-------------------  Bit definition for SETUP4 register  --------------------
//#define SETUP4 ((u16)0x00FF)

///-------------------  Bit definition for SETUP5 register  --------------------
//#define SETUP5 ((u16)0x00FF)

///-------------------  Bit definition for SETUP6 register  --------------------
//#define SETUP6 ((u16)0x00FF)

///-------------------  Bit definition for SETUP7 register  --------------------
//#define SETUP7 ((u16)0x00FF)



#define USB_TOP_STATE_0                             ((u16)0x0020)
#define USB_TOP_STATE_1                             ((u16)0x0040)

///-------------------  Bit definition for EP1_INT_STATE register  --------------------
#define  EP1_INT_STATE_END                          ((u16)0x0002)
#define  EP1_INT_STATE_INNACK                       ((u16)0x0004)
#define  EP1_INT_STATE_INACK                        ((u16)0x0008)
#define  EP1_INT_STATE_INSTALL                      ((u16)0x0010)
#define  EP1_INT_STATE_OUTNACK                      ((u16)0x0020)
#define  EP1_INT_STATE_OUTACK                       ((u16)0x0040)
#define  EP1_INT_STATE_OUTSTALL                     ((u16)0x0080)

///-------------------  Bit definition for EP2_INT_STATE register  --------------------
#define  EP2_INT_STATE_END                          ((u16)0x0002)
#define  EP2_INT_STATE_INNACK                       ((u16)0x0004)
#define  EP2_INT_STATE_INACK                        ((u16)0x0008)
#define  EP2_INT_STATE_INSTALL                      ((u16)0x0010)
#define  EP2_INT_STATE_OUTNACK                      ((u16)0x0020)
#define  EP2_INT_STATE_OUTACK                       ((u16)0x0040)
#define  EP2_INT_STATE_OUTSTALL                     ((u16)0x0080)

///-------------------  Bit definition for EP3_INT_STATE register  --------------------
#define  EP3_INT_STATE_END                          ((u16)0x0002)
#define  EP3_INT_STATE_INNACK                       ((u16)0x0004)
#define  EP3_INT_STATE_INACK                        ((u16)0x0008)
#define  EP3_INT_STATE_INSTALL                      ((u16)0x0010)
#define  EP3_INT_STATE_OUTNACK                      ((u16)0x0020)
#define  EP3_INT_STATE_OUTACK                       ((u16)0x0040)
#define  EP3_INT_STATE_OUTSTALL                     ((u16)0x0080)

///-------------------  Bit definition for EP4_INT_STATE register  --------------------
#define  EP4_INT_STATE_END                          ((u16)0x0002)
#define  EP4_INT_STATE_INNACK                       ((u16)0x0004)
#define  EP4_INT_STATE_INACK                        ((u16)0x0008)
#define  EP4_INT_STATE_INSTALL                      ((u16)0x0010)
#define  EP4_INT_STATE_OUTNACK                      ((u16)0x0020)
#define  EP4_INT_STATE_OUTACK                       ((u16)0x0040)
#define  EP4_INT_STATE_OUTSTALL                     ((u16)0x0080)


///-------------------  Bit definition for EP0_AVIL register  --------------------
#define EP0_AVIL_EPXAVIL                            ((u16)0x00FF)

///-------------------  Bit definition for EP1_AVIL register  --------------------
#define EP1_AVIL_EPXAVIL                            ((u16)0x00FF)

///-------------------  Bit definition for EP2_AVIL register  --------------------
#define EP2_AVIL_EPXAVIL                            ((u16)0x00FF)

///-------------------  Bit definition for EP3_AVIL register  --------------------
#define EP3_AVIL_EPXAVIL                            ((u16)0x00FF)

///-------------------  Bit definition for EP4_AVIL register  --------------------
#define EP4_AVIL_EPXAVIL                            ((u16)0x00FF)

///-------------------  Bit definition for EP0_CTRL register  --------------------
#define EP0_CTRL_TRANEN                             ((u16)0x0080)

#define EP0_CTRL_TRANCOUNT                          ((u16)0x007F)
#define EP0_CTRL_TRANCOUNT_0                        ((u16)0x0001)
#define EP0_CTRL_TRANCOUNT_1                        ((u16)0x0002)
#define EP0_CTRL_TRANCOUNT_2                        ((u16)0x0004)
#define EP0_CTRL_TRANCOUNT_3                        ((u16)0x0008)
#define EP0_CTRL_TRANCOUNT_4                        ((u16)0x0010)
#define EP0_CTRL_TRANCOUNT_5                        ((u16)0x0020)
#define EP0_CTRL_TRANCOUNT_6                        ((u16)0x0040)

///-------------------  Bit definition for EP1_CTRL register  --------------------
#define EP1_CTRL_TRANEN                             ((u16)0x0080)

#define EP1_CTRL_TRANCOUNT                         ((u16)0x007F)
#define EP1_CTRL_TRANCOUNT_0                       ((u16)0x0001)
#define EP1_CTRL_TRANCOUNT_1                       ((u16)0x0002)
#define EP1_CTRL_TRANCOUNT_2                       ((u16)0x0004)
#define EP1_CTRL_TRANCOUNT_3                       ((u16)0x0008)
#define EP1_CTRL_TRANCOUNT_4                       ((u16)0x0010)
#define EP1_CTRL_TRANCOUNT_5                       ((u16)0x0020)
#define EP1_CTRL_TRANCOUNT_6                       ((u16)0x0040)

///-------------------  Bit definition for EP2_CTRL register  --------------------
#define EP2_CTRL_TRANEN                             ((u16)0x0080)

#define EP2_CTRL_TRANCOUNT                          ((u16)0x007F)
#define EP2_CTRL_TRANCOUNT_0                        ((u16)0x0001)
#define EP2_CTRL_TRANCOUNT_1                        ((u16)0x0002)
#define EP2_CTRL_TRANCOUNT_2                        ((u16)0x0004)
#define EP2_CTRL_TRANCOUNT_3                        ((u16)0x0008)
#define EP2_CTRL_TRANCOUNT_4                        ((u16)0x0010)
#define EP2_CTRL_TRANCOUNT_5                        ((u16)0x0020)
#define EP2_CTRL_TRANCOUNT_6                        ((u16)0x0040)

///-------------------  Bit definition for EP3_CTRL register  --------------------
#define EP3_CTRL_TRANEN                             ((u16)0x0080)

#define EP3_CTRL_TRANCOUNT                          ((u16)0x007F)
#define EP3_CTRL_TRANCOUNT_0                        ((u16)0x0001)
#define EP3_CTRL_TRANCOUNT_1                        ((u16)0x0002)
#define EP3_CTRL_TRANCOUNT_2                        ((u16)0x0004)
#define EP3_CTRL_TRANCOUNT_3                        ((u16)0x0008)
#define EP3_CTRL_TRANCOUNT_4                        ((u16)0x0010)
#define EP3_CTRL_TRANCOUNT_5                        ((u16)0x0020)
#define EP3_CTRL_TRANCOUNT_6                        ((u16)0x0040)

///-------------------  Bit definition for EP4_CTRL register  --------------------
#define EP4_CTRL_TRANEN                             ((u16)0x0080)

#define EP4_CTRL_TRANCOUNT                          ((u16)0x007F)
#define EP4_CTRL_TRANCOUNT_0                        ((u16)0x0001)
#define EP4_CTRL_TRANCOUNT_1                        ((u16)0x0002)
#define EP4_CTRL_TRANCOUNT_2                        ((u16)0x0004)
#define EP4_CTRL_TRANCOUNT_3                        ((u16)0x0008)
#define EP4_CTRL_TRANCOUNT_4                        ((u16)0x0010)
#define EP4_CTRL_TRANCOUNT_5                        ((u16)0x0020)
#define EP4_CTRL_TRANCOUNT_6                        ((u16)0x0040)


#endif
#endif //__MM32_REG_DEFINE_V1_H

